OctoberProject3/fio/rand4k_qd_sweep_result.txt
qd1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
qd2: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
qd4: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
qd8: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
qd16: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
qd32: (g=5): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.36
Starting 6 processes
3;fio-3.36;qd1;0;0;5302000;88365;22091;60001;0;215;1.529415;1.138835;2;114453;43.364099;99.505374;95.000000%=46;99.000000%=50;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;10;114475;44.893513;99.544810;70936;93592;100.000000%;88442.058824;3605.928326;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.436667%;6.916667%;1325639;0;15;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.01%;0.01%;0.01%;98.91%;0.97%;0.11%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%
3;fio-3.36;qd2;1;0;9689560;161489;40372;60001;0;254;1.323764;1.013074;5;11976;47.901032;13.038415;95.000000%=60;99.000000%=69;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;10;11999;49.224796;13.162110;152163;166840;100.000000%;161604.949580;3590.134427;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3.628333%;11.058333%;2376009;0;16;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.01%;83.45%;16.35%;0.18%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%
3;fio-3.36;qd4;2;0;17448172;290798;72699;60001;0;1776;1.053645;1.369368;8;65707;53.725832;64.635303;95.000000%=76;99.000000%=97;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;9;65739;54.779477;64.664751;248349;298824;100.000000%;290959.033613;8582.087512;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;4.880000%;15.103333%;3648096;0;18;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.01%;58.32%;40.79%;0.87%;0.01%;0.01%;0.00%;0.01%;0.01%;0.01%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%
3;fio-3.36;qd8;3;0;28601872;476689;119172;60001;0;1344;1.137332;1.389211;8;1560;65.743641;22.356484;95.000000%=108;99.000000%=138;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;15;1561;66.880974;22.408191;433875;488240;100.000000%;476918.907563;10461.818646;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8.291667%;24.078333%;4968793;0;21;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.01%;28.53%;63.74%;7.70%;0.02%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%
3;fio-3.36;qd16;4;0;57003360;950040;237510;60001;0;242;1.025189;0.576868;12;109614;66.142671;118.196012;95.000000%=111;99.000000%=146;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;15;109640;67.167861;118.201834;708965;984600;100.000000%;950485.294118;48862.180574;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;12.493333%;39.401667%;6925893;0;29;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;18.62%;72.82%;8.52%;0.03%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%
3;fio-3.36;qd32;5;0;83892396;1398183;349545;60001;0;240;1.125977;0.692046;20;21641;90.225719;50.858264;95.000000%=173;99.000000%=230;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;24;21655;91.351695;50.858827;1247864;1418936;100.000000%;1399101.529412;23289.645415;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16.951667%;54.346667%;5538015;0;45;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;5.34%;64.12%;29.97%;0.57%;0.01%;0.01%;0.01%;0.01%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;50469437;448;0;275;3601171;41;3601227;79.76%

qd1: (groupid=0, jobs=1): err= 0: pid=59447: Wed Oct  1 18:45:21 2025
  read: IOPS=22.1k, BW=86.3MiB/s (90.5MB/s)(5178MiB/60001msec)
    slat (nsec): min=738, max=215315, avg=1529.41, stdev=1138.84
    clat (usec): min=2, max=114453, avg=43.36, stdev=99.51
     lat (usec): min=10, max=114475, avg=44.89, stdev=99.54
    clat percentiles (nsec):
     |  95th=[46336],  99th=[50432]
   bw (  KiB/s): min=70936, max=93592, per=100.00%, avg=88442.06, stdev=3605.93, samples=119
   iops        : min=17734, max=23398, avg=22110.39, stdev=901.48, samples=119
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=98.91%, 100=0.97%
  lat (usec)   : 250=0.11%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 250=0.01%
  cpu          : usr=2.44%, sys=6.92%, ctx=1325639, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1325500,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
qd2: (groupid=1, jobs=1): err= 0: pid=59734: Wed Oct  1 18:45:21 2025
  read: IOPS=40.4k, BW=158MiB/s (165MB/s)(9462MiB/60001msec)
    slat (nsec): min=714, max=254156, avg=1323.76, stdev=1013.07
    clat (usec): min=5, max=11976, avg=47.90, stdev=13.04
     lat (usec): min=10, max=11999, avg=49.22, stdev=13.16
    clat percentiles (nsec):
     |  95th=[60160],  99th=[69120]
   bw (  KiB/s): min=152163, max=166840, per=100.00%, avg=161604.95, stdev=3590.13, samples=119
   iops        : min=38040, max=41710, avg=40401.18, stdev=897.55, samples=119
  lat (usec)   : 10=0.01%, 20=0.01%, 50=83.45%, 100=16.35%, 250=0.18%
  lat (usec)   : 500=0.01%, 1000=0.01%
  lat (msec)   : 20=0.01%
  cpu          : usr=3.63%, sys=11.06%, ctx=2376009, majf=0, minf=16
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2422390,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
qd4: (groupid=2, jobs=1): err= 0: pid=60012: Wed Oct  1 18:45:21 2025
  read: IOPS=72.7k, BW=284MiB/s (298MB/s)(16.6GiB/60001msec)
    slat (nsec): min=691, max=1776.3k, avg=1053.64, stdev=1369.37
    clat (usec): min=8, max=65707, avg=53.73, stdev=64.64
     lat (usec): min=9, max=65739, avg=54.78, stdev=64.66
    clat percentiles (nsec):
     |  95th=[76288],  99th=[97792]
   bw (  KiB/s): min=248349, max=298824, per=100.00%, avg=290959.03, stdev=8582.09, samples=119
   iops        : min=62087, max=74706, avg=72739.67, stdev=2145.50, samples=119
  lat (usec)   : 10=0.01%, 20=0.01%, 50=58.32%, 100=40.79%, 250=0.87%
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 100=0.01%
  cpu          : usr=4.88%, sys=15.10%, ctx=3648096, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4362043,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
qd8: (groupid=3, jobs=1): err= 0: pid=60304: Wed Oct  1 18:45:21 2025
  read: IOPS=119k, BW=466MiB/s (488MB/s)(27.3GiB/60001msec)
    slat (nsec): min=684, max=1344.9k, avg=1137.33, stdev=1389.21
    clat (usec): min=8, max=1560, avg=65.74, stdev=22.36
     lat (usec): min=15, max=1561, avg=66.88, stdev=22.41
    clat percentiles (usec):
     |  95th=[  109],  99th=[  139]
   bw (  KiB/s): min=433875, max=488240, per=100.00%, avg=476918.91, stdev=10461.82, samples=119
   iops        : min=108468, max=122060, avg=119229.68, stdev=2615.48, samples=119
  lat (usec)   : 10=0.01%, 20=0.01%, 50=28.53%, 100=63.74%, 250=7.70%
  lat (usec)   : 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=8.29%, sys=24.08%, ctx=4968793, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7150468,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
qd16: (groupid=4, jobs=1): err= 0: pid=60589: Wed Oct  1 18:45:21 2025
  read: IOPS=238k, BW=928MiB/s (973MB/s)(54.4GiB/60001msec)
    slat (nsec): min=688, max=242625, avg=1025.19, stdev=576.87
    clat (usec): min=12, max=109614, avg=66.14, stdev=118.20
     lat (usec): min=15, max=109640, avg=67.17, stdev=118.20
    clat percentiles (usec):
     |  95th=[  112],  99th=[  147]
   bw (  KiB/s): min=708965, max=984600, per=100.00%, avg=950485.29, stdev=48862.18, samples=119
   iops        : min=177241, max=246150, avg=237621.20, stdev=12215.48, samples=119
  lat (usec)   : 20=0.01%, 50=18.62%, 100=72.82%, 250=8.52%, 500=0.03%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=12.49%, sys=39.40%, ctx=6925893, majf=0, minf=29
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14250840,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
qd32: (groupid=5, jobs=1): err= 0: pid=60867: Wed Oct  1 18:45:21 2025
  read: IOPS=350k, BW=1365MiB/s (1432MB/s)(80.0GiB/60001msec)
    slat (nsec): min=685, max=240286, avg=1125.98, stdev=692.05
    clat (usec): min=20, max=21641, avg=90.23, stdev=50.86
     lat (usec): min=24, max=21655, avg=91.35, stdev=50.86
    clat percentiles (usec):
     |  95th=[  174],  99th=[  231]
   bw (  MiB/s): min= 1218, max= 1385, per=100.00%, avg=1366.31, stdev=22.74, samples=119
   iops        : min=311966, max=354734, avg=349775.38, stdev=5822.42, samples=119
  lat (usec)   : 50=5.34%, 100=64.12%, 250=29.97%, 500=0.57%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.01%
  cpu          : usr=16.95%, sys=54.35%, ctx=5538015, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=20973099,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=86.3MiB/s (90.5MB/s), 86.3MiB/s-86.3MiB/s (90.5MB/s-90.5MB/s), io=5178MiB (5429MB), run=60001-60001msec

Run status group 1 (all jobs):
   READ: bw=158MiB/s (165MB/s), 158MiB/s-158MiB/s (165MB/s-165MB/s), io=9462MiB (9922MB), run=60001-60001msec

Run status group 2 (all jobs):
   READ: bw=284MiB/s (298MB/s), 284MiB/s-284MiB/s (298MB/s-298MB/s), io=16.6GiB (17.9GB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=466MiB/s (488MB/s), 466MiB/s-466MiB/s (488MB/s-488MB/s), io=27.3GiB (29.3GB), run=60001-60001msec

Run status group 4 (all jobs):
   READ: bw=928MiB/s (973MB/s), 928MiB/s-928MiB/s (973MB/s-973MB/s), io=54.4GiB (58.4GB), run=60001-60001msec

Run status group 5 (all jobs):
   READ: bw=1365MiB/s (1432MB/s), 1365MiB/s-1365MiB/s (1432MB/s-1432MB/s), io=80.0GiB (85.9GB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=50469437/448, sectors=403932760/15616, merge=0/275, ticks=3601171/41, in_queue=3601227, util=79.76%